app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def show
    @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @plan = Plan.new(params[:plan])

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("created_at", "firstname", "lastname", "status", "target", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @plan = Plan.find(params[:id])
    @plan.status = 'Loaded' if params[:commit] == 'Images have been loaded into CDMS'
    @plan.save
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "plans" SET "status" = 'alpha beta', "updated_at" = '2011-10-05 20:12:43.062761' WHERE "plans"."id" = 1

  def destroy
    @plan = Plan.find(params[:id])
    @plan.destroy
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]